Repository: petdance/bobby-tables
Catalog: share/locale/*/LC_MESSAGES/com.bobby-tables.po
Languages: de_de, es_ar

source: Home
de_de: Übersicht
es_ar: Inicio

source: Translations
de_de: Übersetzungen
es_ar: Traducciones

source: About
de_de: Über
es_ar: Acerca

source: # About Bobby Tables and SQL injection
de_de: # Über Bobby Tables und SQL-Einschleusung
es_ar: # Acerca de Bobby Tables e inyecciónes via SQL

source: # Why did Bobby's school lose their records?
de_de: # Warum hat Bobbys Schule ihre Daten verloren?
es_ar: # ¿Por qué la escuela de Bobby perdió los registros

source: The school apparently stores the names of their students in a table called Students. When a new student arrives, the school inserts his/her name into this table. The code doing the insertion might look as follows:
de_de: Die Schule hat anscheinend die Namen der Schüler in einer Tabelle namens `Students` gespeichert. Wenn sich ein neuer Schüler anmeldet, fügt die Schule seinen Namen zur Tabelle hinzu. Der dazugehörige Code könnte etwa so ausschauen:
es_ar: La escuela aparentemente almacena los nombres de sus estudiantes en una tabla llamada Students. Cuando un estudiante llega, la escuela inserta su nombre en esta tabla. El código encargado de la inserción puede tener esta forma:

source: The first line creates a string containing an SQL INSERT statement. The content of the `$studentName` variable is glued into the SQL statement. The second line sends the resulting SQL statement to the database. The pitfall of this code is that outside data, in this case the content of `$studentName`, becomes part of the SQL statement.
de_de: Die erste Zeile erzeugt einen String mit einem SQL-INSERT-Anweisung. Der Inhalt der Variable `$studentName` wird in die SQL-Anweisung eingefügt. Die zweite Zeile schickt die erzeugte SQL-Anweisung an die Datenbank. Die Falle in diesem Code ist, dass Daten von außerhalb, d.h. der Inhalt von `$studentName`, Teil der SQL-Anweisung werden.
es_ar: La primera linea crea una cadena conteniendo la sentencia INSERT de SQL. El contenido de la variable `$studentName` es adherida a la sentencia SQL. La segunda linea envía la sentencia SQL resultante a la base de datos. The pitfall of this code is that outside data, in this case the content of `$studentName`, becomes part of the SQL statement. La trampa de este código es que los datos externos, en este caso, el contenido de `$studentName`, se hace parte de la sentencia SQL.

source: First let's see what the SQL statement looks like if we insert a student named John:
de_de: Wir betrachten zunächst, wie die SQL-Anweisung aussieht, wenn wir einen Schüler namens John hinzufügen:
es_ar: Primero observemos como se ve una sentencia SQL si queremos insertar el nombre de un estudiante 'John':

source: This does exactly what we want: it inserts John into the Students table.
de_de: Das ergibt genau, was wir wollen: John wird der Tabelle `Students` hinzugefügt.
es_ar: Esto hace exactamente lo que queremos: inserta John a la tabla Students.

source: Now we insert little Bobby Tables, by setting `$studentName` to `Robert'); DROP TABLE Students;--`. The SQL statement becomes:
de_de: Jetzt fügen wir Klein Bobby Tables hinzu, indem wir `$studentName` den Wert `Robert'); DROP TABLE Students;--` zuweisen. Die SQL-Anweisung lautet:
es_ar: Ahora insertamos al pequeño Bobby Tables, al asignar `Robert'); DROP TABLE Students;--` a `$studentName`. La sentencia SQL se convierte en:

source: This inserts Robert into the Students table. However, the INSERT statement is now followed by a DROP TABLE statement which removes the entire Students table. Ouch!
de_de: Dies fügt Robert der Tabelle `Students` hinzu, jedoch folgt der INSERT-Anweisung eine DROP-TABLE-Anweisung, die die gesamte Tabelle entfernt. Autsch!
es_ar: Esto inserta Robert en la tabla Students. Sin embargo, la sentencia INSERT tiene ahora una setencia DROP TABLE anexada que elimina la tabla Students por completo.

source: # How to avoid Bobby Tables
de_de: # Wie man Bobby Tables vermeidet
es_ar: # Como evitas 'Bobby Tables'

source: There is only one way to avoid Bobby Tables attacks
de_de: Man kann Bobby-Tables-Angriffe nur vermeiden,
es_ar: Hay sólo una manera de evitar los ataques de tipo Bobby Tables

source: * Do not create SQL statements that include outside data. * Use parameterized SQL calls.
de_de: * indem man keine SQL-Anweisungen erstellt, die von außen kommende Daten enthalten. * indem man SQL-Aufrufe mit Parametern tätigt.
es_ar: * No crear sentencias SQL que incluyan datos del exterior * Usar llamadas SQL parametrizadas.

source: That's it. Don't try to escape invalid characters. Don't try to do it yourself. Learn how to use parameterized statements. Always, every single time.
de_de: Das ist alles. Nicht versuchen, ungültige Zeichen zu maskieren. Nicht versuchen, es eigenhändig zu machen. Lerne, parameterisierte Anweisungen zu benutzen, und zwar immer und jedes Mal.
es_ar: Eso es todo. No trates de escapar caracteres inválidos. No trates de hacerlo tu mismo. Aprende a usar sentencias parametrizadas. Siempre, en cada ocasión.

source: The strip gets one thing crucially wrong. The answer is not to "sanitize your database inputs" yourself. It is prone to error.
de_de: Im Comic wird eine Sache falsch gemacht. Die Antwort lautet nicht, die Datenbankeingaben selber zu bereinigen. Dies ist fehleranfällig.
es_ar: La tira tiene un error crucial. La respuesta no es "sanitizar tus ingresos a bases de datos" tu mismo. Es susceptible a error.

source: Older ASP uses positional placeholders.
de_de: Ältere Versionen von ASP benutzen Ordnungsplatzhalter.
es_ar: Versiones anteriores de ASP usan marcadores de posición.

source: Newer ASP (ASP.Net?) can handle named placeholders.
de_de: Neuere Versionen von ASP (ASP.Net?) können mit benannten Platzhaltern umgehen.
es_ar: Nuevos ASP (ASP.Net?) pueden manejar placeholders con nombres.

source: To do -----
de_de: In Vorbereitung ---------------
es_ar: Por hacer ----------

source: Add some narrative
de_de: Mehr Erläuterung
es_ar: Añadir un poco de narrativa

source: Stored procedures can be invoked with the `cfstoredproc` and `cfprocparam` tags.
de_de: Wenn man gespeicherte Prozeduren in der Datenbank hat, kann man sie mit den Funktionen `cfstoredproc` und `cfprocparam` aufrufen.
es_ar: Procesos almacenados pueden ser invocados con los tags `cfstoredproc` y `cfprocparam`.

source: Recent versions of ColdFusion provide a set of functions to run queries that have a slightly different syntax, but still provide parameterized queries.
de_de: Neuere Versionen von ColdFusion haben Funktionen, um Abfragen mit einer leicht veränderten Syntax durchzuführen, die aber dennoch parameterisierte Abfragen haben.
es_ar: Versiones recientes de ColdFusion proveen un set de funciones para ejecutar consultas que tengan una sintáxis

source: From the [C# Online](http://en.csharp-online.net/) wiki page [ASP.NET Security Hacks--Avoiding SQL Injection](http://en.csharp-online.net/ASP.NET_Security_Hacks%E2%80%94Avoiding_SQL_Injection)
de_de: [ASP.NET Security Hacks — Avoiding SQL Injection](http://en.csharp-online.net/ASP.NET_Security_Hacks%E2%80%Avoiding_SQL_Injection) aus dem [C#-Online-Wiki](http://en.csharp-online.net/)
es_ar: De la wiki [ASP.NET Security Hacks--Avoiding SQL Injection](http://en.csharp-online.net/ASP.NET_Security_Hacks%E2%80%94Avoiding_SQL_Injection) de [C# Online](http://en.csharp-online.net/)

source: // userName is some string valued user input variable userNameParam.Value = userName;
de_de: // userName ist eine vom Benutzer eingegebene Stringvariable userNameParam.Value = userName;
es_ar: // userName es una variable de entrada del usuario con valor cadena de caracteres userNameParam.Value = userName;

source: Or simpler:
de_de: Oder einfacher:
es_ar: O más simple:

source: To use a prepared statement, do something like this:
de_de: Um eine vorbereitete Anweisung zu benutzen:
es_ar: Para usar una sentencia preparada, haz algo como esto:

source: Reference:
de_de: Literaturhinweis:
es_ar: Referencia:

source: - [SqlCommand.Prepare](http://msdn.microsoft.com/en-us/library/system.data.sqlclient.sqlcommand.prepare.aspx) in the .NET Framework Class Library
de_de: - [SqlCommand.Prepare](http://msdn.microsoft.com/en-us/library/system.data.sqlclient.sqlcommand.prepare.aspx) in der Klassenbibliothek des .NET-Framework
es_ar: - [SqlCommand.Prepare](http://msdn.microsoft.com/en-us/library/system.data.sqlclient.sqlcommand.prepare.aspx) en la Librería de clases de .NET

source: Articles:
de_de: Artikel:
es_ar: Artículos:

source: - [SQL injection](http://msdn.microsoft.com/en-us/library/ms161953.aspx) on MSDN - [SQL Injection and how to avoid it](http://blogs.msdn.com/tom/archive/2008/05/29/sql-injection-and-how-to-avoid-it.aspx) on the ASP.NET Debugging blog
de_de: - [SQL injection](http://msdn.microsoft.com/en-us/library/ms161953.aspx) auf MSDN - [SQL Injection and how to avoid it](http://blogs.msdn.com/tom/archive/2008/05/29/sql-injection-and-how-to-avoid-it.aspx) auf dem Blog "ASP.NET Debugging"
es_ar: - [SQL injection](http://msdn.microsoft.com/en-us/library/ms161953.aspx) en MSDN - [SQL Injection and how to avoid it](http://blogs.msdn.com/tom/archive/2008/05/29/sql-injection-and-how-to-avoid-it.aspx) en el blog de Debugging de ASP.NET

source: - Add some narrative - Show code examples
de_de: - Mehr Erläuterung - Codebeispiele zeigen
es_ar: - Añadir más narrativa - Mostrar ejemplos de código

source: Who is Bobby Tables? ====================
de_de: Wer ist Bobby Tables? =====================
es_ar: ¿Quién es Bobby Tables? ====================

source: [From the webcomic _xkcd_](http://xkcd.com/327/)
de_de: [Vom Webcomic _xkcd_](http://xkcd.com/327/)
es_ar: [Del webcomic _xkcd_](http://xkcd.com/327/)

source: <a href="http://xkcd.com/327/"><img src="/img/xkcd.png" alt="xkcd Bobby Tables Cartoon" height="205" width="666" /></a>
de_de: <a href="http://xkcd.com/327/"><img src="/img/xkcd.png" alt="xkcd-Comic &quot;Bobby Tables&quot;" height="205" width="666" /></a>
es_ar: <a href="http://xkcd.com/327/"><img src="/img/xkcd.png" alt="Caricatura de Bobby Tables de xkcd" height="205" width="666" /></a>

source: **School**: Hi, this is your son's school. We're having some computer trouble.
de_de: **Schule**: Hallo, hier spricht die Schule Ihres Sohnes. Wir haben Computerprobleme.
es_ar: **Escuela**: Hola, esta es la escuela de su hijo que le llama. Estamos teniendo algunos problemas de computación.

source: **Mom**: Oh, dear -- Did he break something?
de_de: **Mutter**: Auweia – hat er etwas kaputtgemacht?
es_ar: **Mom**: Oh, dios -- Ha roto algo?

source: **School**: In a way. Did you really name your son `Robert'); DROP TABLE Students;--`?
de_de: **Schule**: So ähnlich. Haben sie Ihren Sohn wirklich `Robert'); DROP TABLE Students;--` genannt?
es_ar: **School**: In a way. Realmente su hijo se llama `Robert'); DROP TABLE Students;--`?

source: **Mom**: Oh. Yes. Little Bobby Tables we call him.
de_de: **Mutter**: Oh. Ja. Wir rufen ihn Klein Bobby Tables.
es_ar: **Mom**: Oh. Si. El pequeño Bobby Tables lo llamamos.

source: **School**: Well, we've lost this year's student records. I hope you're happy.
de_de: **Schule**: Also, der Datenbestand der Schüler dieses Jahres ist futsch. Ich hoffe, Sie sind jetzt glücklich.
es_ar: **School**: Bueno, hemos perdido los registros de los estudiantes de este año. Espero que este contenta.

source: **Mom**: And I hope you've learned to sanitize your database inputs.
de_de: **Mutter**: Und ich hoffe, Sie haben gelernt, Datenbankeingaben zu bereinigen.
es_ar: **Madre**: Y espero que hayan aprendido a sanitizar sus entradas a la base de datos.

source: Examples ========
de_de: Beispiele =========
es_ar: Ejemplos ========

source: See the sidebar to the left for your specific language.
de_de: Siehe Kasten links für die jeweilige Sprache.
es_ar: Ver la barra a la izquierda para tu lenguaje específico.

source: Other resources ===============
es_ar: Otras fuentes ===============

source: Patches welcome ===============
de_de: Verbesserungen sind willkommen ==============================
es_ar: Parches son bienvenidos ===============

source: Don't see a language that you'd like to see represented? Please let me know if you have updates or additions through one of these methods, in decreasing order of preference.
de_de: Wird eine Sprache vermisst? Bitte melde Verbesserungen oder Ergänzungen auf eine dieser drei Arten, in absteigender Reihenfolge der Bevorzugung.
es_ar: No ves un lenguaje que querrías ver representado? Por favor, avisame si tienes actualizaciones o adiciones por alguno de estos métodos, en orden decreciente de preferencia.

source: * Fork the [bobby-tables repository at github](http://github.com/petdance/bobby-tables), make your changes, and send me a pull request. * Add an issue in the [issue tracker](http://github.com/petdance/bobby-tables/issues). * Email me, Andy Lester, at andy at petdance.com.
de_de: * Erstelle einen Fork vom [Repository bobby-tables auf github](http://github.com/petdance/bobby-tables), füge die Änderungen hinzu und schicke mir einen Pull-Request. * Erstelle eine Anfrage im [Fallbearbeitungssystem](http://github.com/petdance/bobby-tables/issues). * Schicke mir eine Email: Andy Lester, andy at petdance.com.
es_ar: * Hacer 'fork' del [repositorio de bobby-tables en github](http://github.com/petdance/bobby-tables), haz tus cambios, y mandame un 'pull request'. * Añade un problema en el [issue tracker](http://github.com/petdance/bobby-tables/issues). * Envíamen un email, Andy Lester, at andy at petdance.com.

source: Translations also welcome =========================
de_de: Übersetzungen sind auch willkommen ==================================
es_ar: Las traducciones son bienvenidas =========================

source: Help translate this site! There are less than 200 phrases. No programming necessary.
de_de: Hilf mit, diesen Webauftritt zu übersetzen! Es sind weniger als 200 Ausdrücke. Keine Programmierung notwendig.
es_ar: Ayuda a traducir este sitio! Hay menos de 200 frases. No es necesario programar.

source: See the instructions at the [bobby-tables repository at github](http://github.com/petdance/bobby-tables#readme).
de_de: Siehe Anleitung im [Repository bobby-tables auf github](http://github.com/petdance/bobby-tables#readme).
es_ar: Ver las instrucciones en [el repositorio de bobby-tables en github](http://github.com/petdance/bobby-tables#readme).

source: To do =====
de_de: In Vorbereitung ===============
es_ar: Por hacer ========

source: * Explain why creating code from outside data is bad. * Potential speed win when reusing prepared statements.
de_de: * Erklärung, warum es schlecht ist, Anweisung auf Grundlage von außerhalb kommender Daten zu erzeugen. * Möglicher Geschwindigkeitszuwachs unter Wiederverwendung vorbereiteter Anweisungen.
es_ar: * Explicar porque crear código con datos externos es malo. * Potencial aumento de la velocidad al usarPotential speed al usar sentencias ya preparadas.

source: Thanks ======
de_de: Danksagung ==========
es_ar: Gracias ======

source: Thanks to the following folks for their contributions:
de_de: Dank gilt den folgenden Leuten für ihre Mitwirkung:
es_ar: Gracias a las siguientes personas por su contribución:

source: The [JDBC API](http://download.oracle.com/javase/tutorial/jdbc/index.html) has a class called [`PreparedStatement`](http://download.oracle.com/javase/6/docs/api/java/sql/PreparedStatement.html) which allows the programmer to safely insert user-supplied data into a SQL query. The location of each input value in the query string is marked with a question mark. The various `set*()` methods are then used to safely perform the insertion.
de_de: Die [JDBC-API](http://download.oracle.com/javase/tutorial/jdbc/index.html) enthält eine Klasse [`PreparedStatement`](http://download.oracle.com/javase/6/docs/api/java/sql/PreparedStatement.html), die Benutzereingaben sicher in eine SQL-Abfrage einfügt. Der Ort jedes Eingabewerts im Abfragestring ist durch ein Fragezeichen markiert. Die diversen Methoden `set*()` werden dann benutzt, um sicher einzufügen.
es_ar: La [API de JDBC](http://download.oracle.com/javase/tutorial/jdbc/index.html) tiene una clase llamada [`PreparedStatement`](http://download.oracle.com/javase/6/docs/api/java/sql/PreparedStatement.html) que permite al programador insertar de modo seguro datos envíados por el usuario a una consulta SQL. La ubicación de cada valor de entrada en la cadena de caracteres de consulta es marcada con un signo de interrogación. Los variados métodos `set*()` son usados para ejecutar la inserción de modo seguro.

source: Once a `PreparedStatement` object has been created, it can be reused multiple times for multiple queries (for example, when using the same query to update multiple rows in a table). However, they are **not thread-safe** because of the many method calls involved in setting the parameters and executing the query. Therefore, you should only define `PreparedStatement` objects as method-level variables (as opposed to class-level variables) to avoid concurrency issues.
de_de: Nachdem ein Objekt vom Typ `PreparedStatement` erzeugt wurde, kann es mehrfach für Abfragen wiederverwendet werden (z.B. wenn dieselbe Abfrage mehrere Zeilen in einer Tabelle aktualisiert). Aber sie sind wegen der vielen Methodenaufrufe, die die Parameter setzen und die Abfrage ausführen, **nicht threadsicher**. Deswegen sollte man Objekte vom Typ `PreparedStatement` nur als methodensichtbare Variablen (im Gegensatz zu klassensichtbaren Variablen) definieren, um Nebenläufigkeitsprobleme zu vermeiden.
es_ar: Una vez que un objeto de tipo`PreparedStatement` ha sido creado, puede ser reusado múltiples veces por multiples consultas (por ejemplo, cuando se utiliza la misma consulta para actualizar múltiples entradas en una tabla). Sin embargo, éstas ** no son seguras al usar hilos** debido a la gran cantidad de llamadas a métodos involucrados en establecer los parámetros y ejecutar la consulta. Por ello, se debe definir objetos `PreparedStatement` como métodos a nivel de variables (opuestos a variables a nivel de clase) para evitar problems de concurrencia.

source: More information on `PreparedStatement` can be found in the [Oracle JDBC tutorial](http://download.oracle.com/javase/tutorial/jdbc/basics/prepared.html).
de_de: Weitere Informationen über `PreparedStatement` sind in der [Oracle-JDBC-Anleitung](http://download.oracle.com/javase/tutorial/jdbc/basics/prepared.html) zu finden.
es_ar: Más información en `PreparedStatements` puede ser encontrada en el tutorial [Oracle JDBC](http://download.oracle.com/javase/tutorial/jdbc/basics/prepared.html).

source: [Hibernate](http://www.hibernate.org/) uses named parameters to safely insert data into a query. A named parameter consists of a colon, followed by a unique name for the parameter.
de_de: [Hibernate](http://www.hibernate.org/) benutzt benannte Parameter, um Daten sicher in eine Abfrage einzufügen. Ein benannter Parameter besteht aus einem Doppelpunkt gefolgt von einem eindeutigen Namen für den Parameter.
es_ar: [Hibernate](http://www.hibernate.org/) utiliza parametros con nombre para insertar de modo seguro datos a una consulta. Un parametro con nombre consiste en un signo de dos puntos, seguido por un nombre único para ese parametro.

source: Hibernate also supports positional parameters like `PreparedStatement`, but named parameters are generally preferred because they make the query a little easier to read.
de_de: Hibernate unterstützt auch Stellenparameter wie in `PreparedStatement`, aber benannte Parameter werden gewöhnlich bevorzugt, weil die Abfrage damit ein bisschen leichter zu lesen ist.
es_ar: Hibernate tambien soporta parametros posicionales como `PreparedStatement`, pero parametros con nombre son preferidos generalmente porque hacen que la consulta sea más fácil de leer.

source: See the [Hibernate Manual](http://docs.jboss.org/hibernate/stable/core/reference/en/html/objectstate.html#objectstate-querying-executing-parameters) for more information on named parameters.
de_de: Siehe das [Handbuch zu Hibernate](http://docs.jboss.org/hibernate/stable/core/reference/en/html/objectstate.html#objectstate-querying-executing-parameters) zu weitere Informationen über benannte Parameter.
es_ar: Ver el [Manual de Hibernate](http://docs.jboss.org/hibernate/stable/core/reference/en/html/objectstate.html#objectstate-querying-executing-parameters) para más informacion acerca de parámetros con nombre.

source: [MyBatis](http://www.mybatis.org/) is a database framework that hides a lot of the JDBC code from the developer, allowing him or her to focus on writing SQL. The SQL statements are typically stored in XML files.
de_de: [MyBatis](http://www.mybatis.org/) ist ein Datenbankframework, das viel von dem JDBC-Code vor dem Entwickler versteckt, so dass er oder sie sich darauf konzentrieren kann, SQL zu schreiben. Die SQL-Anweisungen werden typischerweise in XML-Dateien gespeichert.
es_ar: [MyBatis](http://www.mybatis.org/) es un framework de base de datos que esconde mucha de la logica de JBDC del desarrollador, permitiendole asi a él/ella focalizarse en escribir SQL. Las sentencias de SQL son tipicamente almacenadas en archivos XML.

source: MyBatis automatically creates `PreparedStatement`s behind the scenes. Nothing extra needs to be done by the programmer.
de_de: MyBatis erstellt automatisch `PreparedStatement` hinter den Kulissen. Der Programmierer braucht nichts weiter zu machen.
es_ar: MyBatis automaticamente crea `PreparedStatements` detrás de escenas. Nada adicional deber ser hecho por el programador.

source: To give you some context, here's an example showing how a basic query is called with MyBatis. The input data is passed into the `PeopleMapper` instance and then it gets inserted into the "selectPeopleByNameAndAge" query.
de_de: Um etwas Kontext zu herzustellen, so sieht ein Beispiel aus wie eine einfache Abfrage mit MyBatis aufgerufen wird. Die Eingabedaten werden der Instanz `PeopleMapper` übergeben und dann in die Abfrage "selectPeopleByNameAndAge" eingefügt.
es_ar: Para darte un poco de contexto, aquí hay un ejemplo de como una consulta basica es ejecutada con MyBatis. Los datos de ingreso son pasados a la instancia de `PeopleMapper` y luego insertados a la consulta "selectPeopleByNameAndAge"

source: XML mapping document ====================
de_de: XML-Zuordnungsdatei ===================
es_ar: Documento de mapeo XML ====================

source: <?xml version="1.0" encoding="UTF-8" ?> <!DOCTYPE mapper PUBLIC "-//mybatis.org//DTD Mapper 3.0//EN" "http://mybatis.org/dtd/mybatis-3-mapper.dtd"> <mapper namespace="com.bobbytables.mybatis.PeopleMapper"> <select id="selectPeopleByNameAndAge" resultType="list"> <!-- lastName and age are automatically sanitized ---> SELECT * FROM people WHERE lastName = #{lastName} AND age > #{age} </select> </mapper>
de_de: <?xml version="1.0" encoding="UTF-8" ?> <!DOCTYPE mapper PUBLIC "-//mybatis.org//DTD Mapper 3.0//EN" "http://mybatis.org/dtd/mybatis-3-mapper.dtd"> <mapper namespace="com.bobbytables.mybatis.PeopleMapper"> <select id="selectPeopleByNameAndAge" resultType="list"> <!-- lastName und age werden automatisch bereinigt ---> SELECT * FROM people WHERE lastName = #{lastName} AND age > #{age} </select> </mapper>
es_ar: <?xml version="1.0" encoding="UTF-8" ?> <!DOCTYPE mapper PUBLIC "-//mybatis.org//DTD Mapper 3.0//EN" "http://mybatis.org/dtd/mybatis-3-mapper.dtd"> <mapper namespace="com.bobbytables.mybatis.PeopleMapper"> <select id="selectPeopleByNameAndAge" resultType="list"> <!-- lastName y age son sanitizados automácticamente ---> SELECT * FROM people WHERE lastName = #{lastName} AND age > #{age} </select> </mapper>

source: Mapper class ============
de_de: Zuordnungsklasse ================
es_ar: Clase Mapper ============
