Repository: petdance/bobby-tables
Catalog: share/locale/*/LC_MESSAGES/com.bobby-tables.po
Languages: de_de, es_ar

source: Invoking the query ==================
de_de: Aufruf der Abfrage ==================
es_ar: Invocando la consulta ==================

source: Perl's [DBI](http://search.cpan.org/dist/DBI), available on the [CPAN](http://search.cpan.org), supports parameterized SQL calls. Both the `do` method and `prepare` method support parameters ("placeholders", as they call them) for most database drivers. For example:
de_de: Die Perl-Datenbankschnittstelle [DBI](http://search.cpan.org/dist/DBI), erhältlich vom [CPAN](http://search.cpan.org), beherrscht parameterisierte SQL-Aufrufe. Die Methoden `do` und `prepare` unterstützen Parameter (dort: "Platzhalter") für die meisten Datenbanktreiber. Zum Beispiel:
es_ar: [DBI](http://search.cpan.org/dist/DBI) de Perl,disponible en el [CPAN](http://search.cpan.org), soporta llamadas SQL parametrizadas. Tanto el método `do` como `prepare` soportan parámetros ("placeholders", como ellos los llaman) para la mayortía de los drivers para bases de datos. Por ejemplo:

source: However, you can't use parameterization for identifiers (table names, column names) so you need to use DBI's `quote_identifier()` method for that:
de_de: Man kann aber Parameterisierung nicht für Benenner (Tabellennamen, Spaltennamen) verwenden, also muss man die Methode `quote_identifier()` aus DBI verwenden:
es_ar: Sin embargo, no puedes usar parametrizacion para identificadores (nombres de tablas y columnas) por ello necesotas usar el método `quote_identifier()` de DBI para ello:

source: # Make sure a table name we want to use is safe: my $quoted_table_name = $dbh->quote_identifier($table_name);
de_de: # Dafür sorgen, dass der zu verwendende Tabellenname sicher ist: my $quoted_table_name = $dbh->quote_identifier($table_name);
es_ar: # Asegurate que el nombre de la tabla sea seguro: my $quoted_table_name = $dbh->quote_identifier($table_name);

source: # Assume @cols contains a list of column names you need to fetch: my $cols = join ',', map { $dbh->quote_identifier($_) } @cols;
de_de: # Unter der Annahme, dass @cols eine Liste der zu holenden Spaltennamen enthält: my $cols = join ',', map { $dbh->quote_identifier($_) } @cols;
es_ar: # Asuma que @cols contiene una lista de nombres de columnas que necesitamos: my $cols = join ',', map { $dbh->quote_identifier($_) } @cols;

source: You could also avoid writing SQL by hand by using [DBIx::Class](http://p3rl.org/DBIx::Class), [SQL::Abstract](http://p3rl.org/SQL::Abstract) etc to generate your SQL for you programmatically.
de_de: Man kann auch vermeiden, SQL manuell zu schreiben, indem man [DBIx::Class](http://p3rl.org/DBIx::Class), [SQL::Abstract](http://p3rl.org/SQL::Abstract) usw. verwendet, um SQL programmatisch zu erzeugen.
es_ar: También puedes evitar escribir SQL a mano al usar [DBIx::Class](http://p3rl.org/DBIx::Class), [SQL::Abstract](http://p3rl.org/SQL::Abstract) etc para que genere tu SQL por ti programáticamente.

source: What is Taint mode? -------------------
de_de: Was ist der Taint-Modus? ------------------------
es_ar: ¿Qué es el modo Taint? ----------------------

source: Taint mode is a special set of security checks that Perl performs on data input into your program from external sources. The input data is marked as tainted (untrusted) and may not be used in commands that would allow you to shoot yourself in the foot. See [the perlsec manpage](http://perldoc.perl.org/perlsec.html) for a detailed breakdown of what taint mode tracks.
de_de: Der Taintmodus stellt besondere Sicherheitsprüfungen dar, die Perl an Eingabedaten durchführt, welche aus externen Quellen stammen. Die Eingabedaten werden als "unrein" (nicht vertrauenswürdig) markiert und können nicht in Befehlen verwendet werden, mit denen man sich ins eigene Fleisch schneiden würde. Siehe [perlsec](http://perldoc.perl.org/perlsec.html) für eine detaillierte Übersicht, was der Taintmodus überwacht.
es_ar: El modo Taint es un set de chequeos de seguridad que Perl ejecuta sobre los datos de entrada a tu programa provinientes de fuentes externas. Los datos de entrada son marcados como "manchados" (tainted, no confiables) y pueden o no ser ejecutados en comandos que te permiten tirarte un tiro en tu propio pie. Ver [perlsec manpage](http://perldoc.perl.org/perlsec.html) para obtener un detalle de lo que analiza el modo 'taint'.

source: To invoke taint mode:
de_de: Um den Taintmodus anzuschalten:
es_ar: Para invocar el modo taint:

source: # From the command line perl -T program.pl
de_de: # Auf der Kommandozeile perl -T program.pl
es_ar: # Desde la línea de comando perl -T program.pl

source: # At the top of your script #!/usr/bin/perl -T
de_de: # Am Anfang des Skripts #!/usr/bin/perl -T
es_ar: # En la parte superior de tu script #!/usr/bin/perl -T

source: When your script trips one of the taint checks your application will issue a fatal error message. For testing purposes `-t` will issue warnings instead of fatal errors. `-t` is not a substitute for `-T`.
de_de: Wenn eine Taintprüfung im Skript fehlschlägt, gibt die Anwendung eine fatale Fehlermeldung aus. Für Testzwecke gibt `-t` Warnungen statt fataler Fehler aus. `-t` ist kein Ersatz für `-T`.
es_ar: Cuando tu script no supera uno de los chequeos de 'taint', tu aplicación arrojará un error fatal. Con fines de prueba `-t` arrojará advertencias en lugar de errores fatales. `-t` no es substituto de `-T`.

source: Explain how DBI supports taint mode, both inbound and outbound.
de_de: Erklärung zum Taintmodus von Perl und wie DBI den Taintmodus sowohl einwärts als auch ausgehend unterstützt.
es_ar: Explica como DBI suporta el modo 'taint', tanto entrante como saliente.

source: PHP is a little more disorganized than how [Perl handles parameters](./perl.html). The standard [MySQL extension][mysql] doesn't support parameterization, although the [PostgreSQL extension][pg] does:
es_ar: PHP es un poco más desorganizado que Perl[Perl handles parameters](./perl.html), respecto al manejo de parametros. La extensión [MySQL extension][mysql] standard no soporta parametrización, aunque la de [PostgreSQL extension][pg] si:

source: Note that the query must be in single-quotes or have the `$` escaped to avoid PHP trying to parse it as a variable.
de_de: Hinweis: die Abfrage muss in einfachen Anführungszeichen stehen oder das `$` muss maskiert werden, damit PHP nicht versucht, es als Variable zu analysieren.
es_ar: Nota que la consulta desde estar en comillas simples o tener el signo `$` escapado para que evitar que PHP lo interprete como una variable.

source: **However**, you should probably be using an abstraction layer. The [ODBC][odbc] and [PDO][pdo] extensions both support parameterization and multiple databases:
es_ar: **Sin embargo**, tu deberías estar probablemente usando una capa de abstracción. Tanto las extensión [ODBC][odbc] como [PDO][pdo] soportan parametrización y múltiples bases de datos:

source: ## Using mysqli
es_ar: ## Usando mysqli

source: The MySQL Improved extension handles bound parameters.
de_de: Die Erweiterung MySQL Improved beherrscht Parameterbindung.
es_ar: La extensión de MySQL mejorada maneja parametros con límites.

source: ## Using ADODB
es_ar: ## Usando ADODB

source: ADODB provides a way to prepare, bind and execute all in the same method call.
de_de: Mit ADODB kann man in einem Methodenaufruf eine Anweisung vorbereiten, daran binden und sie ausführen.
es_ar: ADODB provee una manera de preparar, ligar y executar en la misma llamada de método.

source: ## Using the ODBC layer
es_ar: ## Usando la capa ODBC

source: Or:
de_de: Oder:
es_ar: O:

source: ## Using the PDO layer
es_ar: ## Usando la capa PDO

source: Here's the long way to do bind parameters.
de_de: So bindet man Parameter auf die ausführliche Weise.
es_ar: Aquí está la manera larga de ligar parametros.

source: // insert one row $name = 'one'; $value = 1; $stmt->execute();
de_de: // eine Zeile einfügen $name = 'one'; $value = 1; $stmt->execute();
es_ar: // insertar una file $name = 'one'; $value = 1; $stmt->execute();

source: And a shorter way to pass things in.
de_de: Und auf eine kürzere Weise, sie zu übergeben.
es_ar: Y una manera más corta para pasar cosas.

source: Here's a great [tutorial on migrating to PDO for MySQL developers](http://wiki.hashphp.org/PDO_Tutorial_for_MySQL_Developers).
es_ar: Aquí hay un gran [tutorial para migrar PDO para desarolladores MySQL](http://wiki.hashphp.org/PDO_Tutorial_for_MySQL_Developers).

source: # Applications & Frameworks
es_ar: # Applicaciones y Frameworks

source: When using the MVC framework [CakePHP][cakephp], most of your database communication will be abstracted away by the Model API. Still, it is sometimes necessary to perform manual queries, which can be done with [Model::query][cake-model-query]. In order to use prepared statements with that method, you just need to pass an additional array parameter after the SQL query string. There are two variants:
es_ar: Cuando usas un framework MVC [CakePHP][cakephp], la mayoría de tu comunicación con base de datos, será abstraída por la API del Modelo. Igualmente, en ocasiones es necesario ejecutar consultas de manera manual que puede ser hechas con [Model::query][cake-model-query]. Para hacer uso de las sentencias preparadas con este metodo, sólo debés enviar un parámeto adicional del vector despues de la cadena de SQL. Existen dos variantes:

source: // Unnamed placeholders: Pass an array containing one element for each ? $this->MyModel->query( 'SELECT name FROM users WHERE id = ? AND status = ?', array($id, $status) );
es_ar: // Placeholders sin nombre: Pasa un array con un elemento para cada signo ? $this->MyModel->query( 'SELECT name FROM users WHERE id = ? AND status = ?', array($id, $status) );

source: // Named placeholders: Pass an associative array $this->MyModel->query( 'SELECT name FROM users WHERE id = :id AND status = :status', array('id' => $id, 'status' => $status) );
es_ar: // Placeholders con nombres: Pasa un vector asociativo $this->MyModel->query( 'SELECT name FROM users WHERE id = :id AND status = :status', array('id' => $id, 'status' => $status) );

source: This behavior is documented in the [CakePHP Cookbook][cake-cookbook]. (It is described for the `fetchAll()`-method, but `query()` uses `fetchAll()` internally).
es_ar: Este comportamiento está documentado en [CakePHP Cookbook][cake-cookbook]. (Esta descripto para el `fetchAll()`-method, pero `query()` usa `fetchAll()` internamente).

source: If your site/blog/application is running on [WordPress][WP], you can use the `prepare` method of the `$wpdb` class, which supports both a sprintf()-like and vsprintf()-like syntax.
es_ar: Si tu sitio/blog/aplicación esta corriedo sobre [WordPress][WP], tu puedes usar el método `prepare` the la clase `$wpdb`, que soporta una sintaxis similar tanto a sprintf() como a vsprintf().

source: For INSERTs, UPDATEs, and DELETEs, you can use the handy helper methods in the class, which allow you to specify the format of the submitted values.
es_ar: Para INSERTs, UPDATEs, and DELETEs, puedes usar los métodos de ayuda en la clase (helper methods), que permite especificar el formato de los valores enviados.

source: More details on the [WordPress Codex][codex].
es_ar: Más detalles en [WordPress Codex][codex].

source: Examples assume the following table structure:
de_de: Beispiele setzen folgende Tabellenstruktur voraus:
es_ar: Los ejemplos asumen la siguiente estructura de tabla:

source: Always prefer static SQL when possible --------------------------------------
de_de: Wenn möglich, immer statisches SQL bevorzugen ---------------------------------------------
es_ar: Siempre prefiere SQL estático cuando sea posible ----------------------------------------------

source: Static SQL leaves no room for SQL injection.
de_de: Statisches SQL kann keine SQL-Einschleusung verursachen.
es_ar: SQL estático no da lugar a inyecciones SQL.

source: If you need dynamic SQL avoid string concatenation when possible ----------------------------------------------------------------
de_de: Wenn dynamisches SQL benötigt wird, soll wenn möglich Stringverknüpfung vermieden werden ----------------------------------------------------------------------------------------
es_ar: Si necesitas SQL dinámico evita concatenacion de cadenas de caracteres cuando sea posible --------------------------------------------------------------------------------------

source: String concatenation opens doors to possible SQL injection exploits:
de_de: Durch Stringverknüpfung kann es zu SQL-Einschleusung kommen:
es_ar: Concatenacion de strings abre las puertas a vulnerabilidades de inyección de SQL:

source: Instead use bind variables:
de_de: Man benutzt stattdessen Bindevariablen:
es_ar: En su lugar utiliza variables ligadas:

source: Implicit Data Type Conversion Injection ---------------------------------------
de_de: Einschleusung durch implizite Datentypumwandlung ------------------------------------------------
es_ar: Inyección mediante conversion de tipos de datos --------------------------------------------

source: Also NLS session parameters (`NLS_DATE_FORMAT`, `NLS_TIMESTAMP_FORMAT`, `NLS_TIMESTAMP_TZ_FORMAT`, `NLS_NUMERIC_CHARACTER`) can be used to modify or inject SQL statements.
de_de: Auch die NLS-Sitzungsparameter (`NLS_DATE_FORMAT`, `NLS_TIMESTAMP_FORMAT`, `NLS_TIMESTAMP_TZ_FORMAT`, `NLS_NUMERIC_CHARACTER`) können benutzt werden, um SQL-Abfragen zu verändern oder in sie einzuschleusen.
es_ar: También los parámetros de sesión NLS (`NLS_DATE_FORMAT`, `NLS_TIMESTAMP_FORMAT`, `NLS_TIMESTAMP_TZ_FORMAT`, `NLS_NUMERIC_CHARACTER`) pueden ser usados para modificar o inyectar sentencias SQL.

source: In next example data type conversion takes place when `p_since` is implicitly converted to a string for concatenation. Note how the value of `NLS_DATE_FORMAT` affects to the query string in `users_since()` function!
de_de: Im nächsten Beispiel findet Datentypumwandlung statt, wenn `p_since` implizit in einen String für die Verknüpfung umgewandelt wird. Achtung: der Wert von `NLS_DATE_FORMAT` beeinflusst den Abfragestring in der Funktion `users_since()`!
es_ar: En el próximo ejemplo la conversión del tipo de datos tiene lugar cuando `p_since` es implicitamente convertido a una cadena de caracteres para la concatenación. Nota como el valor de `NLS_DATE_FORMAT` afecta la cadena de consulta en la funcion `users_since()`!

source: The remedy is to set the format modifier explicitly: `to_char(p_since, 'YYYY-MM-DD')`.
de_de: Abhilfe schafft, den Formatwandler explizit anzugeben: `to_char(p_since, 'YYYY-MM-DD')`.
es_ar: EL remedio es setear el modificador de formato explícitamente: `to_char(p_since, 'YYYY-MM-DD')`.

source: Now the value of NLS parameter `NLS_DATE_FORMAT` is ignored during the query.
de_de: Jetzt wird der Wert des NLS-Parameters `NLS_DATE_FORMAT` während der Abfrage nicht mehr beachtet.
es_ar: Ahora el valor del parámetro `NLS_DATE_FORMAT` es ignorado durante la consulta.

source: All of PostgreSQL's [procedural languages](http://www.postgresql.org/docs/current/static/xplang.html), which allow you to write functions and procedures inside the database, allow you to execute arbitrary SQL statements.
de_de: Alle [prozeduralen Sprachen von PostgreSQL](http://www.postgresql.org/docs/current/static/xplang.html), mit denen man Funktionen und Prozeduren innerhalb der Datenbank schreiben kann, haben die Fähigkeit, beliebige SQL-Anweisungen auszuführen.
es_ar: Todo el [lenguaje de procedimiento](http://www.postgresql.org/docs/current/static/xplang.html) de PostgreSQL, que permite escribir funciones y procedimientos dentro de la base de datos, permite ejectuar sentencias SQL arbitrarias.

source: The safest way to execute SQL inside a PL/pgSQL statement is just to do so:
de_de: Die sicherste Weise, SQL innerhalb einer PL/pgSQL-Anweisung auszuführen:
es_ar: La manera más segura de ejectutar SQL dentro de una sentencia PL/pgSQL es sólo hacerlo:

source: For such a simple case, you're actually better off writing a pure SQL function:
de_de: In so einem einfachen Fall schreibt man besser eine reine SQL-Funktion:
es_ar: Para un caso tan simple, es mejor si lo escribes en una función pura de SQL:

source: But sometimes you have to do more complicated things. Perhaps you dynamically add `WHERE` clause expressions based on input. In such a case, you'll end up using PL/pgSQL's [`EXECUTE`](http://www.postgresql.org/docs/current/interactive/plpgsql-statements.html#PLPGSQL-STATEMENTS-EXECUTING-DYN) syntax. Here's an example with an SQL injection vulnerability:
es_ar: Pero en ocasiones hay que hacer cosas más complicadas. Tal vez añades dinámicamente expresiones de clausulas `WHERE` basadas en la entrada del usuario. EN tal caso, terminarás usando sintáxis PL/pgSQL's [`EXECUTE`](http://www.postgresql.org/docs/current/interactive/plpgsql-statements.html#PLPGSQL-STATEMENTS-EXECUTING-DYN). Aquí hay un ejemplo con una vulnerabilidad de inyección SQL:

source: Both the `p_column` and the `p_value` arguments are vulnerable. One way to avoid this problem is to use the `quote_ident()` function to quote SQL identifiers (`p_column` in this case) and `quote_lteral()` and quote literal values:
es_ar: Tanto el argumento `p_column` como `p_value` son vulnerables. Una manera de evitar este problema es utilizar la función `quote_ident()` para citar identificadores SQL (`p_column` en este caso) y `quote_lteral()` con valores de cita literales:

source: It's quite a bit easier to read, too! Better yet, employ the `USING` clause of the [`EXECUTE`](http://www.postgresql.org/docs/current/interactive/plpgsql-statements.html#PLPGSQL-STATEMENTS-EXECUTING-DYN) command for values (available since v8.4):
es_ar: Es también un poco más facil de leer! Mejor aún, usando la clausula 'USING' del comando para valores [`EXECUTE`](http://www.postgresql.org/docs/current/interactive/plpgsql-statements.html#PLPGSQL-STATEMENTS-EXECUTING-DYN) (disponible desde v8.4):

source: This form avoids the run-time overhead of converting values to text and back in addition to protecting against SQLi.
es_ar: Esta forma evita la sobrecarga en tiempo de ejecución al convertir valores a texto y nuevamente sumado a la protección contra SQLi.

source: Using the [Python DB API](http://wiki.python.org/moin/DatabaseProgramming/), don't do this:
de_de: Unter Verwendung der [Python-DB-API](http://wiki.python.org/moin/DatabaseProgramming/) ist das folgende falsch:
es_ar: Usando la [Python DB API](http://wiki.python.org/moin/DatabaseProgramming/), no hagas esto:

source: # Do NOT do it this way. cmd = "update people set name='%s' where id='%s'" % (name, id) curs.execute(cmd)
de_de: # Dieses Beispiel ist FALSCH. cmd = "update people set name='%s' where id='%s'" % (name, id) curs.execute(cmd)
es_ar: # NO lo hagas de esta manera. cmd = "update people set name='%s' where id='%s'" % (name, id) curs.execute(cmd)

source: Instead, do this:
de_de: Stattdessen korrekt:
es_ar: En su lugar, haz esto:

source: Note that the placeholder syntax depends on the database you are using.
es_ar: Nota que la sintaxis de marcador de posición depende de la base de datos que se use.

source: 'qmark' Question mark style, e.g. '...WHERE name=?' 'numeric' Numeric, positional style, e.g. '...WHERE name=:1' 'named' Named style, e.g. '...WHERE name=:name' 'format' ANSI C printf format codes, e.g. '...WHERE name=%s' 'pyformat' Python extended format codes, e.g. '...WHERE name=%(name)s'
es_ar: 'qmark' Estilo con signo de pregunta, e.g. '...WHERE name=?' 'numeric' Estilo con posición numérica, e.g. '...WHERE name=:1' 'named' Estilo nombrado, e.g. '...WHERE name=:name' 'format' Códigos de formato de printf de ANSI C, e.g. '...WHERE name=%s' 'pyformat' Códigos extendidos de formato de Python, e.g. '...WHERE name=%(name)s'

source: The values for the most common databases are:
es_ar: Los valores para las bases de datos más comunes son:

source: So if you are using MySQL or PostgreSQL, use `%s` (even for numbers and other non-string values!) and if you are using SQLite use `?`
es_ar: Entonces si estás usando MySQL o PostgresSQL, us `%s` (incluso para números y otros valores no-cadenas-de-caracteres!) y si estás usando SQLite utiliza `?`

source: - Add some narrative.
de_de: - Mehr Erläuterung.
es_ar: - Añadir más narrativa.

source: In Ruby on Rails using [ActiveRecord](http://guides.rubyonrails.org/active_record_querying.html):
de_de: In Ruby on Rails mit [ActiveRecord](http://guides.rubyonrails.org/active_record_querying.html):
es_ar: En Ruby on Rails usando [ActiveRecord](http://guides.rubyonrails.org/active_record_querying.html):

source: or
de_de: oder
es_ar: o

source: Using [Ruby/DBI](http://ruby-dbi.rubyforge.org/): analog to [Perl](./perl.html).
de_de: [Ruby/DBI](http://ruby-dbi.rubyforge.org/) ist analog zu [Perl](./perl.html).
es_ar: Usando [Ruby/DBI](http://ruby-dbi.rubyforge.org/): análogo a [Perl](./perl.html).

source: [CHICKEN](http://www.call-with-current-continuation.org/) is a compiler for [Scheme](http://schemers.org/)
de_de: [CHICKEN](http://www.call-with-current-continuation.org/) ist ein Compiler für [Scheme](http://schemers.org/)
es_ar: [CHICKEN](http://www.call-with-current-continuation.org/) es un compilador para [Scheme](http://schemers.org/)

source: # Translations
de_de: # Übersetzungen
es_ar: # Traducciones

source: The following natural languages are supported on bobby-tables.com:
de_de: Die folgenden natürlichen Sprachen werden auf bobby-tables.com unterstützt:
es_ar: Los siguientes lenguajes naturales son soportados por bobby-tables.com

source: * [English](http://bobby-tables.com/) (native) * [German](http://bobby-tables.com/de_DE/) (fairly current) * [Russian](http://bobby-tables.com/ru_RU/) (just starting)
de_de: * [englisch](http://bobby-tables.com/) (ursprünglich) * [deutsch](http://bobby-tables.com/de_DE/) (ziemlich aktuell) * [russisch](http://bobby-tables.com/ru_RU/) (erst am Anfang)
es_ar: * [Inglés](http://bobby-tables.com/) (nativo) * [Alemán](http://bobby-tables.com/de_DE/) (medianamente actualizado) * [Ruso](http://bobby-tables.com/ru_RU/) (recién empezado)

source: We'd love to have translations into other languages as well. Please contact the [bobby-tables mailing list][1] and ask a team member about how you can help.
es_ar: Nos encantaría tener traducciones a otros idiomas tambien. Por favor contacta la [lista de correo de bobby-tables][1] y pregunta a un miembro como puedes ayudar.

source: # Contributing translations
de_de: # an Übersetzungen mitwirken
es_ar: # Contribuyendo a las traducciones

source: 1. Run `make messages`.
de_de: 1. Führe `make messages` aus.
es_ar: 1. Ejecutar `make messages`.

source: 2. Skip this step if you just amend a translation. If you need to start a new language, copy `share/locale/com.bobby-tables.pot` to `share/locale/xx_YY/LC_MESSAGES/com.bobby-tables.po`, but substitute `xx` for the appropriate [language code][2] and `YY` for the [territory code][3]. (Alternatively to copying, use the command `msginit`.) Naming convention examples:
es_ar: 2. Saltea este paso si sólo estás agregando una traducción. Si necesitas empezar un nuevo lenguaje, copia `share/locale/com.bobby-tables.pot` a `share/locale/xx_YY/LC_MESSAGES/com.bobby-tables.po`, pero substituye `xx` por el [codigo de lenguaje][2] apropiado y `YY` por el [código de territorio][3]. (Alternativamente a copiar, usa el comando `msginit`.) Ejemplos de convenciones de nombre :

source: sv_SE.po standard Swedish pt_BR.po Brazilian Portuguese
de_de: sv_SE.po Standardschwedisch pt_BR.po brasilianisches Portugiesisch
es_ar: sv_SE.po sueco estandar pt_BR.po portugués brasilero
