Repository: petdance/bobby-tables
Catalog: share/locale/*/LC_MESSAGES/com.bobby-tables.po
Languages: de_de, es_ar

source: 3. Edit the PO file. [Lokalize (formerly KBabel)][Lokalize] is excellent, [Poedit][Poedit] is good. Any text editor supporting UTF-8 can handle PO files, but it will not be as convenient.
es_ar: 3. Edita el archivo PO. [Lokalize (antiguamente KBabel)][Lokalize] es excelente, [Poedit][Poedit] es bueno.Cualquier editor de texto con soporte para UTF-8 puede manejar PO files, pero no va a ser tan de conveniente.

source: 4. Run the normal `make` step.
de_de: 4. Führe den normalen `make`-Schritt aus.
es_ar: 4. Ejecuta el paso normal `make`.

source: # Guidelines for translations
de_de: # Leitfaden für Übersetzungen
es_ar: # Guía para las traducciones

source: * Become familiar with the source mark-up language [Markdown][Markdown] used for producing the rendered HTML. The backtick (\`) is an important piece of syntax pertaining to translation, it indicates code, e.g. a variable name, and code is not translated, i.e. copy the source text into the target language as-is. Indented paragraphs are also code. Translate only comments in such code blocks.
es_ar: * Hazte familiar con el lenguajde de markup del código fuente [Markdown][Markdown] que se utiliza para producir el HTML. La comilla simple (\`) es una importante pieza de sintáxis ya que indica código, e.g. el nombre de una variable, y el código no debe ser traducido, i.e. copiar el código de origen al destino tal como se encuentra. Párrafos identados también son código. Traduce solo los comentarios en estos bloques de código.

source: * To find out where a piece of English is from to see the context, run `ack -a 'source text goes here'`. Most of the source text is in directory `s/`. Run `make clean` first to avoid duplicates in build files. (If you don't have [ack][ack] you can use `grep -R`.
es_ar: * Para encontrar donde se encuentra una pieza en inglés, o para ver el contexto, puedes usar `ack -a 'texto de origen aquí'`. La mayoría del texto esta en el directorio `s/`. Corre `make clean` primero para evadir duplicados en los archivos usados para generar el build (build files). (Si no tienes [ack][ack] puedes usar `grep -R`.

source: * You can check your progress by running `make l10n-status`.
de_de: * Du kannst deinen Fortschritt mittels `make l10n-status` beobachten.
es_ar: * Puedes verificar el progreso ejecutando `make l10n-status`.

source: Apart from that, the normal rules for any translation apply:
de_de: Außerdem gelten die normalen Richtlinien für jedwede Übersetzungen:
es_ar: Aparte de esto, las reglas normales para cualquier traducción aplican:

source: * Don't translate literally or word-by-word, instead capture the essence of each sentence/paragraph and reformulate it so it reads naturally. If you have to merge or rearrange sentence parts, do it.
es_ar: * No traduzcas literalmente o palara por palabra, en lugar de eso, captura la escencia de cada oración/párrafo y escribela para que se lea de manera natural. Si tienes que unir o re organizar partes de oraciones, hazlo.

source: * Avoid keeping key words/technical jargon in English, consult the standard literature for existing translations of key words. (Software vendors such as Microsoft and KDE publish shared translation tables, import those into your PO editor, too.) In case you find no good translation, use your imagination and put yourself into the position of a member of your potential audience: is the sentence still understandable? If not, add a parenthetical remark to the key word.
es_ar: * Evita mantener la palabras claves/vocabulario técnico en inglés. (Alguna compañias de software como Microsoft o KDE publican tablas de traducción compartidas, importalas a tu editor de PO, también.) En caso de no encontrar una buena traducción, usa la imaginación y ponte en la posición de un miembro de tu audiencia potencial: ¿es la oración todavía entendible? Sino, añade una marca entre paréntesis a la palabra clave.

source: * It can happen that source text is wrong in some way (typos, factual errors). This should be improved first in a separate patch, independent from your translation. Fix it yourself, and if not possible (e.g. because the English text is ambiguous), use `git annotate` to find out who wrote it and ask for clarification.
es_ar: * Puede ocurrir que el texto de origen tenga errores de algún tipo (typos, errores de hecho). Esto debe ser mejorado en una rama ('branch') separada, independiente de tu traducción. Arréglalo por ti mismo, y si no es possible (e.g. porque el texto en inglés es ambiguo), usa `git annotate` para averiguar quien lo escibió y solicitar una clarificación.

source: This site's content is available under the <a href="https://creativecommons.org/licenses/by-sa/3.0/">Creative Commons Attribution-ShareAlike 3.0 License</a>
de_de: Die Inhalte dieser Website stehen unter der <a href="http://creativecommons.org/licenses/by-sa/3.0/">Creative-Commons-Lizenz mit Namensnennung und Weitergabe unter gleichen Bedingungen, Version 3.0</a>.
es_ar: El contenido de este sitio está disponible bajo una licencia<a href="https://creativecommons.org/licenses/by-sa/3.0/">Creative Commons Attribution-ShareAlike 3.0 License</a>

source: Fork me on GitHub
de_de: Mach auf GitHub mit
es_ar: Haz un Fork en GitHub

source: Bobby Tables: A guide to preventing SQL injection
de_de: Bobby Tables: Ein Leitfaden gegen SQL-Einschleusung
es_ar: Bobby Tables: Una guía para prevenir inyección de SQL

source: bobby-tables.com: A guide to preventing SQL injection in {currlang}
de_de: bobby-tables.com: Ein Leitfaden gegen SQL-Einschleusung in {currlang}
es_ar: bobby-tables.com: Una guía para prevenir inyección de SQL en {currlang}

source: bobby-tables.com: A guide to preventing SQL injection
de_de: bobby-tables.com: Ein Leitfaden gegen SQL-Einschleusung
es_ar: bobby-tables.com: Una guía para prevenir la inyeccion de SQL

source: In ColdFusion there is a tag called `cfqueryparam` that should be used whenever writing inline queries.
de_de: In ColdFusion gibt es eine Funktion `cfqueryparam`, die immer benutzt werden sollte, um eingebettete Abfragen zu schreiben.

source: Other random resources ======================
de_de: Andere wahllose Ressourcen ==========================

source: String name = //user input int age = //user input Connection connection = DriverManager.getConnection(...); PreparedStatement statement = connection.prepareStatement( "SELECT * FROM people WHERE lastName = ? AND age > ?" ); statement.setString(1, name); //lastName is a VARCHAR statement.setInt(2, age); //age is an INT ResultSet rs = statement.executeQuery(); while (rs.next()){ //... }
de_de: String name = //Benutzereingabe int age = //Benutzereingabe Connection connection = DriverManager.getConnection(...); PreparedStatement statement = connection.prepareStatement( "SELECT * FROM people WHERE lastName = ? AND age > ?" ); statement.setString(1, name); //lastName is a VARCHAR statement.setInt(2, age); //age is an INT ResultSet rs = statement.executeQuery(); while (rs.next()){ //... }

source: List<Person>; people = //user input Connection connection = DriverManager.getConnection(...); connection.setAutoCommit(false); try { PreparedStatement statement = connection.prepareStatement( "UPDATE people SET lastName = ?, age = ? WHERE id = ?"); for (Person person : people){ statement.setString(1, person.getLastName()); statement.setInt(2, person.getAge()); statement.setInt(3, person.getId()); statement.execute(); } connection.commit(); } catch (SQLException e) { connection.rollback(); }
de_de: List<Person>; people = //Benutzereingabe Connection connection = DriverManager.getConnection(...); connection.setAutoCommit(false); try { PreparedStatement statement = connection.prepareStatement( "UPDATE people SET lastName = ?, age = ? WHERE id = ?"); for (Person person : people){ statement.setString(1, person.getLastName()); statement.setInt(2, person.getAge()); statement.setInt(3, person.getId()); statement.execute(); } connection.commit(); } catch (SQLException e) { connection.rollback(); }

source: String name = //user input int age = //user input Session session = //... Query query = session.createQuery("from People where lastName = :name and age > :age"); query.setString("name", name); query.setInteger("age", age); Iterator people = query.iterate();
de_de: String name = //Benutzereingabe int age = //Benutzereingabe Session session = //... Query query = session.createQuery("from People where lastName = :name and age > :age"); query.setString("name", name); query.setInteger("age", age); Iterator people = query.iterate();

source: String name = //user input int age = //user input SqlSessionFactory sqlMapper = //... SqlSession session = sqlMapper.openSession(); try { PeopleMapper mapper = session.getMapper(PeopleMapper.class); List<Person> people = mapper.selectPeopleByNameAndAge(name, age); //data is automatically sanitized for (Person person : people) { //... } } finally { session.close(); }
de_de: String name = //Benutzereingabe int age = //Benutzereingabe SqlSessionFactory sqlMapper = //... SqlSession session = sqlMapper.openSession(); try { PeopleMapper mapper = session.getMapper(PeopleMapper.class); List<Person> people = mapper.selectPeopleByNameAndAge(name, age); //data is automatically sanitized for (Person person : people) { //... } } finally { session.close(); }

source: PHP is a little more disorganized than how [Perl handles parameters](./perl.html). The standard [MySQL extension](http://php.net/manual/en/book.mysql.php) doesn't support parameterization, although the [PostgreSQL extension](http://www.php.net/manual/en/book.pgsql.php) does:
de_de: PHP ist ein bisschen unorganisierter im [Vergleich zu Perl](./perl.html). Die Standarderweiterung [MySQL](http://php.net/manual/de/book.mysql.php) beherrscht keine Parameterisierung, aber die Erweiterung [PostgreSQL](http://www.php.net/manual/de/book.pgsql.php) schon:

source: **However**, you should probably be using an abstraction layer. The [ODBC](http://php.net/manual/en/book.uodbc.php) and [PDO](http://www.php.net/manual/en/book.pdo.php) extensions both support parameterization and multiple databases:
de_de: Es sollte jedoch wohl eine Abstraktionsschicht verwendet werden. Die [ODBC-](http://php.net/manual/en/book.uodbc.php) und [PDO-Erweiterungen](http://www.php.net/manual/en/book.pdo.php) unterstützen sowohl Parameterisierung und mehrere Datenbanken:

source: Using mysqli ------------
de_de: Mittels mysqli --------------

source: Using ADODB -----------
de_de: Mittels ADODB -------------

source: Using the ODBC layer --------------------
de_de: Mittels ODBC ------------

source: Using the PDO layer -------------------
de_de: Mittels PDO -----------

source: CREATE OR REPLACE FUNCTION users_since( p_since IN DATE ) RETURN userlist_t PIPELINED AS v_users userlist_t; v_query constant varchar2(32767) := 'SELECT username FROM users WHERE superuser = 0 and accessed_at > ''' || to_char(p_since, 'YYYY-MM-DD') || ''' order by accessed_at desc'; BEGIN DBMS_OUTPUT.PUT_LINE('v_query = ' || v_query); EXECUTE IMMEDIATE v_query BULK COLLECT INTO v_users;
de_de: CREATE OR REPLACE FUNCTION users_since( p_since IN DATE ) RETURN userlist_t PIPELINED AS v_users userlist_t; v_query constant varchar2(32767) := 'SELECT username FROM users WHERE superuser = 0 and accessed_at > ''' || p_since || ''' order by accessed_at desc'; BEGIN DBMS_OUTPUT.PUT_LINE('v_query = ' || v_query); EXECUTE IMMEDIATE v_query BULK COLLECT INTO v_users;

source: But sometimes you have to do more complicated things. Perhaps you dynamically add `WHERE` clause expressions based on input. In such cases, you'll end up using PL/pgSQL's `EXECUTE` syntax. Here's an example with an SQL injection vulnerability:
de_de: Aber manchmal möchte man kompliziertere Sachen machen wie z.B. `WHERE`-Teilausdrücke dynamisch je nach Eingabedaten hinzuzufügen. In diesem Fall benutzt man die `EXECUTE`-Syntax von PL/pgSQL. Ein Beispiel mit einer Gefährdung durch SQL-Einschleusung:

source: Both the `p_column` and the `p_value` arguments are vulnerable. The way to avoid this problem is to use the `quote_ident()` function to quote an SQL identifier (`p_column` in this case) and `quote_lteral()` to quote a literal value:
de_de: Die Argumente `p_column` und `p_value` sind beide angreifbar. Um das Problem zu vermeiden, wird die Funktion `quote_ident()` verwendet, um einen SQL-Bezeichner (hier: `p_column`) zu maskieren und `quote_literal()`, um einen Literalwert zu maskieren:

source: It's quite a bit easier to read, too!
de_de: So ist es auch viel leichter zu lesen!

source: TODO.
de_de: In Vorbereitung.

source: TODO.
de_de: In Vorbereitung.

source: We'd love to have translations into other languages as well. Please contact the [bobby-tables mailing list](https://groups.google.com/forum/#!forum/bobby-tables) and ask a team member about how you can help.
de_de: Wir würden gerne auch Übersetzungen für andere Sprachen haben. Bitte schreibe an die [bobby-tables-Mailingliste](https://groups.google.com/forum/#!forum/bobby-tables) und frage einen Teilnehmer, wie du helfen kannst.

source: 2. Skip this step if you just amend a translation. If you need to start a new language, copy `share/locale/com.bobby-tables.pot` to `share/locale/xx_YY/LC_MESSAGES/com.bobby-tables.po`, but substitute `xx` for the appropriate [language code](http://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) and `YY` for the [territory code](http://en.wikipedia.org/wiki/ISO_3166-1_alpha-2). (Alternatively to copying, use the command `msginit`.) Naming convention examples:
de_de: 2. Überspringe diesen Schritt, wenn du nur eine Übersetzung verbesserst. Falls du eine neue Sprache anfängst, kopiere `share/locale/com.bobby-tables.pot` nach`share/locale/xx_YY/LC_MESSAGES/com.bobby-tables.po`, aber ersetze `xx` mit dem entsprechenden [Sprachcode](http://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) und `YY` mit dem [Territorialcode](http://en.wikipedia.org/wiki/ISO_3166-1_alpha-2). (Alternativ zum Kopieren benutze den Befehl `msginit`.) Beispiele für die Namenskonvention:

source: 3. Edit the PO file. [Lokalize (formerly KBabel)](http://l10n.kde.org/tools/) is excellent, [Poedit](http://www.poedit.net/) is good. Any text editor supporting UTF-8 can handle PO files, but it will not be as convenient.
de_de: 3. Bearbeite die PO-Datei. [Lokalize (vormals KBabel)](http://l10n.kde.org/tools/) ist ausgezeichnet, [Poedit](http://www.poedit.net/) ist gut. Jeder Texteditor, der UTF-8 unterstützt, kann mit PO-Dateien umgehen, aber es ist nicht so bequem.

source: * Become familiar with the source mark-up language "Markdown" used for producing the rendered HTML. The backtick (\`) is an important piece of syntax pertaining to translation, it indicates code, e.g. a variable name, and code is not translated, i.e. copy the source text into the target language as-is. Indented paragraphs are also code. Translate only comments in such code blocks.
de_de: * Mache dich mit der Auszeichnungssprache "Markdown" vertraut, aus welcher HTML produziert wird. Der Gravis (\`) ist ein für Übersetzungen wichtiger Teil der Syntax; er kennzeichnet Code, z.B. einen Variablennamen. Code wird nicht übersetzt, d.h. der Ursprungstext wird unverändert in die Zielsprache übernommen. Eingerückte Absätze stellen auch Code dar. Übersetze in solchen Codeblöcken nur die Kommentare.

source: * To find out where a piece of English is from to see the context, run `ack -a 'source text goes here'`. Most of the source text is in directory `s/`. Run `make clean` first to avoid duplicates in build files. (If you don't have [ack](http://betterthangrep.com) you can use `grep -R`.
de_de: * Um herauszufinden, woher ein englischer Text stammt, um den Kontext zu sehen, führe `ack -a 'source text goes here'` aus. Der überwiegende Teil des Ursprungstextes befindet sich im Verzeichnis `s/`. Führe zunächst `make clean` aus, um Duplikate in den Build-Dateien zu vermeiden. (Wenn du [ack](http://betterthangrep.com) nicht hast, kannst du `grep -R` verwenden.

source: * Don't translate literally or word-by-word, instead capture the essence of each sentence/paragraph and reformulate it so it reads naturally. If you have to merge or rearrange sentence parts, do it.
de_de: * Übersetze nicht wortwörtlich, sondern drücke das Wesentliche eines Satzes/Absatzes aus und formuliere es so, dass es sich natürlich liest. Scheue nicht davor zurück, dafür Satzteile zu verbinden oder umzubauen.

source: * Avoid keeping key words/technical jargon in English, consult the standard literature for existing translations of key words. (Software vendors such as Microsoft and KDE publish shared translation tables, import those into your PO editor, too.) In case you find no good translation, use your imagination and put yourself into the position of a member of your potential audience: is the sentence still understandable? If not, add a parenthetical remark to the key word.
de_de: * Vermeide es, verständnistragende Wörter/technische Fachwörter unübersetzt zu lassen. Ziehe die Standardliteratur für existierende Übersetzungen zu Rate. (Softwarehersteller wie Microsoft oder KDE veröffentlichen Übersetzungstabellen, importiere sie auch in den PO-Editor.) Wenn du keine gute Übersetzung findest, stelle dir vor, du wärst in der Stelle deiner Zielgruppe: ist der Satz noch verständlich? Falls nicht, füge eine Erläuterung in Klammern hinzu.

source: * It can happen that source text is wrong in some way (typos, factual errors). This should be improved first in a separate patch, independent from your translation. Fix it yourself, and if not possible (e.g. because the English text is ambiguous), use `git annotate` to find out who wrote it and ask for clarification.
de_de: * Es kommt vor, dass der Ursprungstext falsch ist (Tipp- oder Sachfehler). Das sollte zunächst in einem gesonderten Patch unabhängig von deiner Übersetzung verbessert werden. Korrigiere es selbst, und falls das nicht geht (z.B. weil der englische Text mehrdeutig ist), benutze `git annotate`, um herauszufinden, wer das geschrieben hat und bitte um Klarstellung.
